src/Marello/Bundle/InvoiceBundle/Tests/Functional/Api/responses/get_invoice_by_invoiceNumber.yml

data:
    type: marelloinvoices
    id: '<toString(@marello_invoice_1->id)>'
    meta:
        __class__: Marello\Bundle\InvoiceBundle\Entity\Invoice
    attributes:
        invoiceNumber: '000000002'
        invoicedAt: '@marello_invoice_1->invoicedAt->format("Y-m-d\TH:i:s\Z")'
        invoiceDueDate: null
        paymentMethod: Paypal
        paymentReference: null
        paymentDetails: null
        shippingMethod: null
        shippingMethodType: null
        currency: GBP
        status: null
        subtotal: '1501.0000'
        totalTax: '260.5040'
        grandTotal: '1511.0000'
        shippingAmountInclTax: '10.0000'
        shippingAmountExclTax: '10.0000'
    relationships:
        billingAddress:
            data:
                type: marelloaddresses
                id: '25'
        shippingAddress:
            data:
                type: marelloaddresses
                id: '25'
        order:
            data:
                type: marelloorders
                id: '<toString(@marello_order_1->id)>'
        customer:
            data:
                type: marellocustomers
                id: '<toString(@customer1->id)>'
        salesChannel:
            data:
                type: marellosaleschannels
                id: chan_gbp
        items:
            data:
                -
                    type: marelloinvoiceitems
                    id: '2'
                -
                    type: marelloinvoiceitems
                    id: '3'
                -
                    type: marelloinvoiceitems
                    id: '4'
                -
                    type: marelloinvoiceitems
                    id: '5'
        organization:
            data:
                type: organizations
                id: '1'
